 ###### reference:
 - http://nikgrozev.com/2015/07/01/reshaping-in-pandas-pivot-pivot-table-stack-and-unstack-explained-with-pictures
 
 - https://pandas.pydata.org/pandas-docs/stable/generated/pandas.wide_to_long.html
 
 - https://chrisalbon.com/python/pandas_long_to_wide.html
 
 - https://gist.github.com/ligyxy/41247d3605d87145f2502f10a8513cad

In [112]:
np.array([0, 1, 2, 3, 4]

SyntaxError: unexpected EOF while parsing (<ipython-input-112-e8626c55ef06>, line 1)

In [123]:
import pandas as pd
import numpy as np
raw_data = {'account_no': np.array(["A", "B", "C", "D", "E"]),
        'id':[1,2,3,4,5],
        'age': ["1", "2", "3", "4", "5"],
        'score': [6252, 24243, 2345, 2342, 23525],
        'sex':[0,1,1,0,1]}
df_wide = pd.DataFrame(raw_data)
df_wide

  account_no age  id  score  sex
0          A   1   1   6252    0
1          B   2   2  24243    1
2          C   3   3   2345    1
3          D   4   4   2342    0
4          E   5   5  23525    1

In [124]:
df_long=pd.melt(df_wide,id_vars=['account_no','id'],value_vars=['score','sex'], var_name='VarName', value_name='Value')
df_long

  account_no  id VarName  Value
0          A   1   score   6252
1          B   2   score  24243
2          C   3   score   2345
3          D   4   score   2342
4          E   5   score  23525
5          A   1     sex      0
6          B   2     sex      1
7          C   3     sex      1
8          D   4     sex      0
9          E   5     sex      1

In [149]:
#重新转回宽表
df_wide2=df_long.pivot(index='account_no', columns='VarName', values='Value')
print df_wide2.index
print df_wide2.columns
df_wide2['id']=df_wide2.index
df_wide2

Index([u'A', u'B', u'C', u'D', u'E'], dtype='object', name=u'account_no')
Index([u'score', u'sex'], dtype='object', name=u'VarName')

VarName     score  sex id
account_no
A            6252    0  A
B           24243    1  B
C            2345    1  C
D            2342    0  D
E           23525    1  E

Index([u'A', u'B', u'C', u'D', u'E'], dtype='object', name=u'account_no')
Index([u'score', u'sex', u'id'], dtype='object', name=u'VarName')

In [43]:
np.random.seed(123)
df = pd.DataFrame({"A1970" : {0 : "a", 1 : "b", 2 : "c"},
"A1980" : {0 : "d", 1 : "e", 2 : "f"},
"B1970" : {0 : 2.5, 1 : 1.2, 2 : .7},
"B1980" : {0 : 3.2, 1 : 1.3, 2 : .1},
"X"     : dict(zip(range(3), np.random.randn(3)))
})
df["id"] = df.index
print(df)
print '----------------------------------'

print pd.wide_to_long(df, ["A", "B"], i="id", j="year")

  A1970 A1980  B1970  B1980         X  id
0     a     d    2.5    3.2 -1.085631   0
1     b     e    1.2    1.3  0.997345   1
2     c     f    0.7    0.1  0.282978   2
----------------------------------
                X  A    B
id year
0  1970 -1.085631  a  2.5
1  1970  0.997345  b  1.2
2  1970  0.282978  c  0.7
0  1980 -1.085631  d  3.2
1  1980  0.997345  e  1.3
2  1980  0.282978  f  0.1

In [58]:
from collections import OrderedDict
from pandas import DataFrame
table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [59]:
p = d.pivot(index='Item', columns='CType', values='USD')
p

CType Bronze Gold Silver
Item
Item0     2$   1$   None
Item1   None   3$     4$

In [55]:
p = d.pivot(index='Item', columns='CType')
p

         USD                 EU
CType Bronze Gold Silver Bronze Gold Silver
Item
Item0     2$   1$   None     2€   1€   None
Item1   None   3$     4$   None   3€     4€

In [64]:
table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item0', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  [1, 2, 3, 4]),
    ('EU',   [1.1, 2.2, 3.3, 4.4])
))
d = DataFrame(table)
print d
p = d.pivot_table(index='Item', columns='CType', values='USD',aggfunc=np.mean)
p

    Item   CType  USD   EU
0  Item0    Gold    1  1.1
1  Item0  Bronze    2  2.2
2  Item0    Gold    3  3.3
3  Item1  Silver    4  4.4

CType  Bronze  Gold  Silver
Item
Item0     2.0   2.0     NaN
Item1     NaN   NaN     4.0

In [65]:
# Row Multi-Index
row_idx_arr = list(zip(['r0', 'r0'], ['r-00', 'r-01']))
row_idx = pd.MultiIndex.from_tuples(row_idx_arr)

# Column Multi-Index
col_idx_arr = list(zip(['c0', 'c0', 'c1'], ['c-00', 'c-01', 'c-10']))
col_idx = pd.MultiIndex.from_tuples(col_idx_arr)

# Create the DataFrame
d = DataFrame(np.arange(6).reshape(2,3), index=row_idx, columns=col_idx)
d = d.applymap(lambda x: (x // 3, x % 3))
d

             c0              c1
           c-00    c-01    c-10
r0 r-00  (0, 0)  (0, 1)  (0, 2)
   r-01  (1, 0)  (1, 1)  (1, 2)

In [66]:
# Stack/Unstack
s = d.stack()
s

                  c0      c1
r0 r-00 c-00  (0, 0)     NaN
        c-01  (0, 1)     NaN
        c-10     NaN  (0, 2)
   r-01 c-00  (1, 0)     NaN
        c-01  (1, 1)     NaN
        c-10     NaN  (1, 2)

In [67]:
u = d.unstack()
u

        c0                              c1
      c-00            c-01            c-10
      r-00    r-01    r-00    r-01    r-00    r-01
r0  (0, 0)  (1, 0)  (0, 1)  (1, 1)  (0, 2)  (1, 2)

In [92]:
df = pd.DataFrame({'foo': ['one','one','one','two','two','two'],
                       'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                       'baz': [1, 2, 3, 4, 5, 6]})
print df
df.pivot(index='foo', columns='bar', values='baz')

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [158]:
pd.get_dummies(df.bar)

     A    B    C
0  1.0  0.0  0.0
1  0.0  1.0  0.0
2  0.0  0.0  1.0
3  1.0  0.0  0.0
4  0.0  1.0  0.0
5  0.0  0.0  1.0

In [159]:
df.join()

0    A
1    B
2    C
3    A
4    B
5    C
Name: bar, dtype: object